closedCavity/1m/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 303;

boundaryField
{
    hotWall
    {
        type            externalWallHeatFluxTemperature;
        mode		flux;
        q		uniform 5000;
        kappaMethod	fluidThermo;
        value		473;
    }

    insulatedWalls
    {
        type            zeroGradient;
    }

    ambientWalls
    {
        type            fixedValue;
        value		303;
    }
}

// ************************************************************************* //
