closedCavity/1m/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)		//0
    (5 0 0)		//1
    (5 5 0)		//2
    (0 5 0)		//3
    (0 0 0.01)		//4
    (5 0 0.01)		//5
    (5 5 0.01)		//6
    (0 5 0.01)		//7
    
    (2 0 0)		//8
    (3 0 0)		//9
    (3 0 0.01)		//10
    (2 0 0.01)		//11
    
    (2 5 0)		//12
    (3 5 0)		//13
    (3 5 0.01)		//14	
    (2 5 0.01)		//15
);

blocks
(
    hex (0 8 12 3 4 11 15 7) (50 50 1) simpleGrading (1 1 1)
    hex (8 9 13 12 11 10 14 15) (50 50 1) simpleGrading (1 1 1)
    hex (9 1 2 13 10 5 6 14) (50 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    hotWall
    {
        type wall;
        faces
        (
            (8 9 10 11)
        );
    }
    insulatedWalls
    {
        type wall;
        faces
        (
            (0 8 11 4)
            (9 1 5 10)
        );
    }
    ambientWalls
    {
        type wall;
        faces
        (
            (0 3 7 4)
            (3 12 15 7)
            (12 13 14 15)
            (13 2 6 14)
            (2 1 5 6)
        );
    }
    front
    {
    	type empty;
    	faces
    	(
    	    (0 8 12 3)
    	    (8 9 13 12)
    	    (9 1 2 13)
    	);
    }
    back
    {
    	type empty;
    	faces
    	(
    	    (4 11 15 7)
    	    (11 10 14 15)
    	    (10 5 6 14)
    	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
